# Вычисляет площадь прямоугольника.
#
#   Параметры на вход:
#       a (int) - длина первой стороны прямоугольника
#       b (int) - длина второй стороны прямоугольника
#
#   Пример вызова:
#       area(5, 3)
#
#   Результат:
#       15
def area(a, b):
    return a * b


# Вычисляет периметр прямоугольника.
#
#   Параметры на вход:
#       a (int) - длина первой стороны прямоугольника
#       b (int) - длина второй стороны прямоугольника
#
#   Пример вызова:
#       perimeter(5, 3)
#
#   Результат:
#       16
def perimeter(a, b):
    return 2 * (a + b)