# Вычисляет площадь треугольника.
#
#   Параметры на вход:
#       a (int) - длина основания треугольника
#       h (int) - высота, проведённая к основанию
#
#   Пример вызова:
#       area(6, 4)
#
#   Результат:
#       12.0
def area(a, h):
    return a * h / 2


# Вычисляет периметр треугольника.
#
#   Параметры на вход:
#       a (int) - длина первой стороны треугольника
#       b (int) - длина второй стороны треугольника
#       c (int) - длина третьей стороны треугольника
#
#   Пример вызова:
#       perimeter(3, 4, 5)
#
#   Результат:
#       12
def perimeter(a, b, c):
    return a + b + c